# YOLOv10n-Mamba-Evolution (Vengeance V2)
nc: 10 
scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]    # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]   # 1-P2/4 (重点引出位)
  - [-1, 3, C2f, [128, True]]    # 2
  - [-1, 1, Conv, [256, 3, 2]]   # 3-P3/8
  - [-1, 6, C2f, [256, True]]    # 4 (引出位)
  - [-1, 1, Conv, [512, 3, 2]]   # 5-P4/16
  - [-1, 6, C2f, [512, True]]    # 6 (引出位)
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]   # 8
  - [-1, 1, SPPF, [1024, 5]]     # 9
  - [-1, 1, PSA, [1024]]         # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 11 (P5->P4)
  - [[-1, 6], 1, Concat, [1]]  # 12
  - [-1, 3, C2f, [512]]        # 13 (过渡)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 14 (P4->P3)
  - [[-1, 4], 1, Concat, [1]]  # 15
  - [-1, 3, C2f, [256]]        # 16 (过渡)

  # --- P2 层极小目标加强区 ---
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 17 (P3->P2)
  - [[-1, 1], 1, Concat, [1]]  # 18 (合并 Backbone P2)
  - [-1, 3, LG_VSSBlock, [128]] # 19 (P2 检测口 - 256x256)

  - [-1, 1, Conv, [128, 3, 2]] # 20 (P2->P3)
  - [[-1, 16], 1, Concat, [1]] # 21
  - [-1, 3, LG_VSSBlock, [256]] # 22 (P3 检测口 - 128x128)

  - [-1, 1, Conv, [256, 3, 2]] # 23 (P3->P4)
  - [[-1, 13], 1, Concat, [1]] # 24
  - [-1, 3, LG_VSSBlock, [512]] # 25 (P4 检测口 - 64x64)

  - [-1, 1, Conv, [512, 3, 2]] # 26 (P4->P5)
  - [[-1, 10], 1, Concat, [1]] # 27
  - [-1, 3, LG_VSSBlock, [1024]] # 28 (P5 检测口 - 32x32)

  - [[19, 22, 25, 28], 1, v10Detect, [nc]] # 29 (四头联动)
