# YOLOv10n-Mamba 🚀 by Gemini
# 结合了 YOLOv10 的高效 Head 和 Mamba 的全局感受野

nc: 80 # 修改为你的实际类别数
scales: # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] 

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, VSSBlock, [512]]   # 6-P4/16: 引入 Mamba 提取深层全局特征
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, VSSBlock, [1024]]  # 8-P5/32: 在最底层使用 Mamba 增强长序列建模
  - [-1, 1, SPPF, [1024, 5]]   # 9
  - [-1, 1, PSA, [1024]]       # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]        # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]        # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]]        # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [1024]]       # 22 (P5/32-large)

  - [[16, 19, 22], 1, v10Detect, [nc]] # Detect(P3, P4, P5)
